PresentationFile.tex
% Created 2019-12-03 Tue 16:08
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jackm}
\date{\textit{<2019-12-03 Tue>}}
\title{n-Back Test}
\hypersetup{
 pdfauthor={Jackm},
 pdftitle={n-Back Test},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
By
\begin{itemize}
\item Max Su
\item Shameem Hedoo
\item Jack Moffat
\end{itemize}


\section{What we did}
\label{sec:org67f5a69}
Used psychopy to create an n-back test, based off of \href{https://osf.io/ewu5m/}{``Matt's miscellaneous PsychoPy code''}



\section{What we want to do}
\label{sec:org9903b4d}
Actually process some code

\section{some code}
\label{sec:orga0dfb9c}
\begin{verbatim}
def makeMatches(in_list,trials=5,
                threshold=0, n_back=2,
                keep_list_stats=True, verbose=False):
    '''Creates the matches in a given list.if a random number is greater than threshold,
    then match the letters at positions [idx] and [idx-n_back]
    in_list: list of letters, strings, etc
    threshold: type(float) in range(0,1)ld
    keep_stats: Bool: will output a list with information on
    the matches (position, character) and their frequency
verbose: Bool: prints information about the lists for immediate viewing
    '''
    out_list = [i for i in in_list]
    list_stats = []  # list holding the character and positions it was matched at
    num_matches = 0
    for idx, char in enumerate(in_list):
        if idx > 1:
            if (random.random() > threshold):
                out_list[idx] = in_list[idx-n_back]
                list_stats.append([(idx, idx-2), char]
                                  ) if keep_list_stats else None
                num_matches += 1

    real_match_rate = num_matches / (len(in_list) - 2)

#####################
# create trial list #
#####################

n_trials = 15
match_frequency_threshold = 0.5
alphabet = [i for i in "ABCDEFGHIJKLMNOPQRSTUVWXYZ"]
initial_letters = [random.choice(alphabet) for i in range(n_trials)]

trial_list = makeMatches(initial_letters,n_trials,
                         threshold=match_frequency_threshold, keep_list_stats=False)

\end{verbatim}


\section{some useful stuff}
\label{sec:org8a38a6e}

\subsection{latex-preview-mode}
\label{sec:orgd00ac7e}
This lets you preview your report as you make it (in latex)

\begin{verbatim}
C-c C-e l l
open file.tex
edit text as you please
#+BEGIN_SRC emacs-lisp
  (use-package latex-preview-pane
    :ensure t
    :config
    (latex-preview-pane-enable)
    )
#+END_SRC

\end{verbatim}
\end{document}
